[
  {
    "projetId": "ohmyfood",
    "titre": "OhMyFood",
    "cover": "https://theRoseOfThePhoenix.github.io/p12_Portfolio/assets/ohmyfood/omf2.JPG",
    "pictures": [],
    "scenario": "Vous avez intégré Ohmyfood en tant que développeur junior. Il s'agit d'une jeune startup qui voudrait s'imposer sur le marché de la restauration. Déjà présente à New-York, elle souhaite désormais faire sa place à Paris.",
    "objectifs": [
      "Votre mission est de développer un site “mobile first” qui répertorie les menus de restaurants gastronomiques. En plus des systèmes classiques de réservation, les clients pourront composer le menu de leur repas pour que les plats soient prêts à leur arrivée. Finis, les temps d'attente au restaurant !",
      "En plus des systèmes classiques de réservation, les clients pourront composer le menu de leur repas pour que les plats soient prêts à leur arrivée. Finis, les temps d'attente au restaurant !",
      "Développer le site en mobile, tablette et desktop en s'appuyant rigoureusement sur les informations déterminées dans le brief créatif !"
    ],
    "infos": [
      "Intégration Web, HTML - CSS - SASS.",
      "Dynamisme / Animation en CSS - SASS.",
      "Référencement naturel SEO."
    ],
    "technologies": ["HTML5", "CSS3", "SASS", "Figma", "Github"],
    "repository": "https://github.com/theRoseOfThePhoenix/p4_omyfood_2023",
    "page": "https://theroseofthephoenix.github.io/p4_omyfood_2023/"
  },
  {
    "projetId": "kasa",
    "titre": "Kasa",
    "cover": "https://theRoseOfThePhoenix.github.io/p12_Portfolio/assets/kaza/kaza.png",
    "pictures": [],
    "scenario": "Kasa vous recrute en tant que développeur front-end en freelance pour développer sa nouvelle plateforme web. Kasa est dans le métier de la location d'appartements entre particuliers depuis près de 10 ans maintenant. Avec plus de 500 annonces postées chaque jour, Kasa fait partie des leaders de la location d'appartements entre particuliers en France. L'occasion parfaite pour vous d'ajouter une belle référence à votre portfolio de freelance ! Le site de Kasa a été codé il y a maintenant plus de 10 ans en ASP.NET avec un code legacy important. Laura, la CTO, a donc lancé une refonte totale pour passer à une stack complète en JavaScript avec NodeJS côté back-end, et React côté front-end. Kasa en a également profité pour commander de nouvelles maquettes auprès de son designer habituel, qui est en freelance. Un gros chantier pour cette année !",
    "objectifs": [
      "Démarrer le projet React et développer l'ensemble de l'application, les composants React, les routes React Router, en suivant les maquettes Figma (responsives !). Et ce avec un code de qualité !",
      "Le recrutement de la personne en charge du back-end n'est pas terminé et va prendre plus de temps que prévu. Du coup, il va falloir que tu fasses sans pour le moment. Je t'ai extrait les 20 dernières annonces de logements dans ce fichier JSON pour que tu puisses construire le Front qui correspond.",
      "Développer avec Create React App ou Vite et utiliser SASS."
    ],
    "infos": [
      "Intégration Web, React avec Create React App.",
      "Dynamisme / Animation en React - SASS.",
      "Utilisation du fichier Json pour toutes les données.",
      "Référencement naturel SEO."
    ],
    "technologies": [
      "HTML5",
      "CSS3",
      "Javascript",
      "SASS",
      "Figma",
      "Github",
      "React"
    ],
    "repository": "https://github.com/theRoseOfThePhoenix/p8_Kaza",
    "page": "https://theroseofthephoenix.github.io/p8_Kaza/"
  },
  {
    "projetId": "nina-carducci",
    "titre": "Nina Carducci",
    "cover": "https://theRoseOfThePhoenix.github.io/p12_Portfolio/assets/nina/Nina.jpg",
    "pictures": [],
    "scenario": "Vous êtes développeur freelance et vous décidez de proposer vos services d’optimisation SEO à de nouveaux clients. Parmi vos prospects, il y a le site de Nina Carducci, une photographe dont vous a parlé l’un de vos amis. Après l'avoir contacté en proposant vos services elle à acceptée votre offre. Vous êtes donc maintenant prêt à débuter ce projet pour votre nouveau client. À vous de jouer ! ",
    "objectifs": [
      "Récupérer le code source du projet afin d'avoir une bonne vision des éléments qui peuvent être à modifier et de déceler les premiers axes d’amélioration.",
      "Optimiser les performance du site en se basant sur l'audit Lighthouse, notamment par rapport aux images",
      "Optimiser le référencment du site tant sur la partie technique que local ainsi que les réseaux sociaux",
      "Optimiser l'accessibilité du site en utilisant l'extension WAVE"
    ],
    "infos": [
      "Intégration Web, HTML - CSS.",
      "Optimisation SEO technique, local et social",
      "Optimisation de performance et d'acccessibilté"
    ],
    "technologies": ["HTML5", "CSS3", "Lighthouse", "Github", "WAVE"],
    "repository": "https://github.com/theRoseOfThePhoenix/ninacarducci-p9",
    "page": "https://theroseofthephoenix.github.io/ninacarducci-p9/"
  },
  {
    "projetId": "sophie-bluel",
    "titre": "Sophie Bluel",
    "cover": "https://theRoseOfThePhoenix.github.io/p12_Portfolio/assets/sophie/sophie-bluel.png",
    "pictures": [],
    "scenario": "Vous travaillez en tant que développeur front-end pour l'agence ArchiWebos qui compte 50 collaborateurs. Après avoir terminé votre dernier projet un peu plus tôt que prévu, vous êtes envoyé en tant que développeur front-end dans une équipe travaillant sur la conception du site portfolio d'un architecte d'intérieur.",
    "objectifs": [
      "Développer la page de présentation du travail de l'architecte (à partir du HTML fourni).",
      "Développer des modalités de téléchargement et de suppression de nouveaux médias.",
      "Développer la page de connexion de l'administrateur (client) du site (code à créer de toutes pièces)."
    ],
    "infos": [
      "Intégration Web, HTML - CSS.",
      "Dynamisme / Animation par JavaScript.",
      "Utilisation des API REST dans ce projet.",
      "Référencement SEO naturel."
    ],
    "technologies": ["HTML5", "CSS3", "SASS", "Javascript", "Github", "Figma"],
    "repository": "https://github.com/theRoseOfThePhoenix/Portfolio-architecte-sophie-bluel",
    "page": "https://theroseofthephoenix.github.io/Portfolio-architecte-sophie-bluel/"
  },

  {
    "techno": [
      "HTML5",
      "CSS3",
      "SASS",
      "Javascript",
      "Github",
      "Figma",
      "Lighthouse",
      "WAVE",
      "React",
      "Vite"
    ]
  }
]
